export default {
	resetLimitsHeader: 'Сбросить ограничения для студентов',

	resetLimitsHintPart1: 'Если студент посмотрел чужие решения по упражнению, он не может повысить ' +
		'имевшийся у него на тот момент балл за это упражнение.',
	resetLimitsHintPart2: 'Вы сбрасываете факт просмотра чужих решений во всех упражнениях. ' +
		'Это позволит студентам получить баллы за упражнения, если они перепошлют решение.',
	resetLimitsHintPart3: 'Для тестов с автоматической проверкой автором курса задается максимальное количество попыток cдачи теста. ' +
		'После достижения лимита студент может делать новые попытки сдачи теста, но они не увеличивают его балл.',
	resetLimitsHintPart4: 'Вы сбрасываете сделанное студентом количество попыток всех тестов. ' +
		'Баллы студента за тесты сохраняются. Студент сможет сделать столько новых попыток, как если бы он еще не делал ни одной.',

	resetButtonText: 'Сбросить',
};
