import getPluralForm from './getPluralForm';

describe('getPluralForm', () => {
	test('для нуля', () => {
		expect(getPluralForm(0, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для единицы', () => {
		expect(getPluralForm(1, 'студент', 'студента', 'студентов')).toBe('студент');
	});
	test('для двух', () => {
		expect(getPluralForm(2, 'студент', 'студента', 'студентов')).toBe('студента');
	});
	test('для трёх', () => {
		expect(getPluralForm(3, 'студент', 'студента', 'студентов')).toBe('студента');
	});
	test('для четырёх', () => {
		expect(getPluralForm(4, 'студент', 'студента', 'студентов')).toBe('студента');
	});
	test('для пяти', () => {
		expect(getPluralForm(105, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для одиннадцати', () => {
		expect(getPluralForm(111, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для пятнадцати', () => {
		expect(getPluralForm(115, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для двадцати', () => {
		expect(getPluralForm(120, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для тридцати одного', () => {
		expect(getPluralForm(31, 'студент', 'студента', 'студентов')).toBe('студент');
	});
	test('для пятидесяти четырех', () => {
		expect(getPluralForm(54, 'студент', 'студента', 'студентов')).toBe('студента');
	});
	test('для пятидесяти пяти', () => {
		expect(getPluralForm(55, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для шестидесяти восьми', () => {
		expect(getPluralForm(68, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для ста', () => {
		expect(getPluralForm(100, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для ста тридцати одного', () => {
		expect(getPluralForm(131, 'студент', 'студента', 'студентов')).toBe('студент');
	});
	test('для строки', () => {
		expect(getPluralForm('1', 'студент', 'студента', 'студентов')).toBe('студент');
	});
	test('для undefined', () => {
		expect(getPluralForm(undefined, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
	test('для null', () => {
		expect(getPluralForm(null, 'студент', 'студента', 'студентов')).toBe('студентов');
	});
});
