export default {
	moderationGuides: [
		'Вы можете отредактировать флекшарту перед публикацией',
		'После отклонения флешкарты попадают в отдельный список, вы всё еще сможете опубликовать их',
		'Если автор отредактирует отклоненную флешкарту, она снова попадёт в список на модерацию'
	],
	toasts: {
		flashcardSaved: 'Флешкарта сохранена',
		flashcardRemoved: 'Флешкарта удалена',
		flashcardApproved: 'Флешкарта опубликована',
		flashcardDeclined: 'Флешкарта отклонена',
		startCourseRepeating: 'Переход к повторению по курсу'
	}
};
