export default {
	statesInfo: {
		saveCardBeforeUnit: 'Карточка сохранена, можете создать еще одну или начать решать карточки этого модуля.',
		unitRepeating: 'Вы прошли все карточки этого модуля, можете создать свою, ' +
			'либо перейти к повторению карточек за весь курс.',
		createCardAfterUnit: 'Карточка сохранена, можете создать ещё одну, ' +
			'перейти к повторению модуля или всех карточек за курс.',
		moderateCards: 'Вы просмотрели все карточки, ' +
			'можете начать решать карточки этого модуля или закрыть окно.',
		noFlashcards: 'В данном модуле пока нет карточек, можете создать свои.',
	},
	buttons: {
		createCard: 'Создать карточку',
		startUnitCheck: 'Начать проверку',
		repeatCourse: 'Повторить курс'
	}
};
